; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=91, remove_proportion=0.101, bases=36, instance_id=28, output=./training, seed=69

(define (problem warehouse-28)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 box49 box50 box51 box52 box53 box54 box55 box56 box57 box58 box59 box60 box61 box62 box63 box64 box65 box66 box67 box68 box69 box70 box71 box72 box73 box74 box75 box76 box77 box78 box79 box80 box81 box82 box83 box84 box85 box86 box87 box88 box89 box90 box91 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 base19 base20 base21 base22 base23 base24 base25 base26 base27 base28 base29 base30 base31 base32 base33 base34 base35 base36 - base
    )
    (:init
        (to-remove box5)
        (to-remove box9)
        (to-remove box13)
        (to-remove box22)
        (to-remove box42)
        (to-remove box45)
        (to-remove box71)
        (to-remove box78)
        (to-remove box88)
        (clear-base base1)
        (clear box81)
        (on box81 box33)
        (on-base box33 base2)
        (clear box29)
        (on box29 box46)
        (on-base box46 base3)
        (clear box72)
        (on box72 box88)
        (on-base box88 base4)
        (clear box13)
        (on box13 box67)
        (on box67 box30)
        (on box30 box26)
        (on-base box26 base5)
        (clear box48)
        (on box48 box73)
        (on box73 box40)
        (on-base box40 base6)
        (clear box31)
        (on box31 box23)
        (on box23 box24)
        (on-base box24 base7)
        (clear box77)
        (on box77 box49)
        (on box49 box90)
        (on-base box90 base8)
        (clear box76)
        (on-base box76 base9)
        (clear box18)
        (on box18 box16)
        (on box16 box38)
        (on box38 box34)
        (on box34 box10)
        (on box10 box53)
        (on box53 box87)
        (on-base box87 base10)
        (clear-base base11)
        (clear box59)
        (on-base box59 base12)
        (clear box17)
        (on box17 box56)
        (on-base box56 base13)
        (clear box80)
        (on box80 box32)
        (on box32 box22)
        (on box22 box61)
        (on box61 box20)
        (on-base box20 base14)
        (clear-base base15)
        (clear box35)
        (on box35 box36)
        (on box36 box84)
        (on-base box84 base16)
        (clear box85)
        (on box85 box47)
        (on box47 box66)
        (on box66 box27)
        (on box27 box42)
        (on-base box42 base17)
        (clear box52)
        (on box52 box62)
        (on box62 box37)
        (on box37 box57)
        (on-base box57 base18)
        (clear box89)
        (on box89 box15)
        (on-base box15 base19)
        (clear box19)
        (on box19 box50)
        (on-base box50 base20)
        (clear box6)
        (on-base box6 base21)
        (clear box41)
        (on-base box41 base22)
        (clear box69)
        (on-base box69 base23)
        (clear box78)
        (on box78 box28)
        (on-base box28 base24)
        (clear box83)
        (on box83 box71)
        (on box71 box25)
        (on-base box25 base25)
        (clear box60)
        (on box60 box12)
        (on box12 box82)
        (on box82 box51)
        (on-base box51 base26)
        (clear box63)
        (on box63 box11)
        (on box11 box65)
        (on box65 box14)
        (on box14 box1)
        (on box1 box45)
        (on-base box45 base27)
        (clear box75)
        (on box75 box3)
        (on-base box3 base28)
        (clear box86)
        (on box86 box9)
        (on box9 box74)
        (on box74 box4)
        (on-base box4 base29)
        (clear box2)
        (on-base box2 base30)
        (clear box39)
        (on box39 box55)
        (on-base box55 base31)
        (clear box54)
        (on box54 box64)
        (on box64 box79)
        (on-base box79 base32)
        (clear box21)
        (on box21 box70)
        (on-base box70 base33)
        (clear box5)
        (on box5 box44)
        (on-base box44 base34)
        (clear box43)
        (on box43 box68)
        (on box68 box58)
        (on-base box58 base35)
        (clear box8)
        (on box8 box7)
        (on box7 box91)
        (on-base box91 base36)
    )
    (:goal (and 
        (removed box5)
        (removed box9)
        (removed box13)
        (removed box22)
        (removed box42)
        (removed box45)
        (removed box71)
        (removed box78)
        (removed box88)
    ))
)

; plan
1. (remove box13 box67)
   deleted: (on box13 box67) (clear box13)
   added: (removed box13) (clear box67)
   goals met: 1 of 9
2. (move box63 box11 box17)
   deleted: (clear box17) (on box63 box11)
   added: (on box63 box17) (clear box11)
   goals met: 1 of 9
3. (move box11 box65 box18)
   deleted: (clear box18) (on box11 box65)
   added: (on box11 box18) (clear box65)
   goals met: 1 of 9
4. (move box65 box14 box11)
   deleted: (clear box11) (on box65 box14)
   added: (on box65 box11) (clear box14)
   goals met: 1 of 9
5. (move box14 box1 box19)
   deleted: (clear box19) (on box14 box1)
   added: (on box14 box19) (clear box1)
   goals met: 1 of 9
6. (move box1 box45 box14)
   deleted: (clear box14) (on box1 box45)
   added: (on box1 box14) (clear box45)
   goals met: 1 of 9
7. (move box72 box88 box1)
   deleted: (clear box1) (on box72 box88)
   added: (on box72 box1) (clear box88)
   goals met: 1 of 9
8. (move box80 box32 box2)
   deleted: (clear box2) (on box80 box32)
   added: (on box80 box2) (clear box32)
   goals met: 1 of 9
9. (move box32 box22 box21)
   deleted: (clear box21) (on box32 box22)
   added: (on box32 box21) (clear box22)
   goals met: 1 of 9
10. (remove box22 box61)
   deleted: (on box22 box61) (clear box22)
   added: (removed box22) (clear box61)
   goals met: 2 of 9
11. (move box83 box71 box29)
   deleted: (clear box29) (on box83 box71)
   added: (on box83 box29) (clear box71)
   goals met: 2 of 9
12. (move box85 box47 box31)
   deleted: (clear box31) (on box85 box47)
   added: (on box85 box31) (clear box47)
   goals met: 2 of 9
13. (move box47 box66 box32)
   deleted: (clear box32) (on box47 box66)
   added: (on box47 box32) (clear box66)
   goals met: 2 of 9
14. (move box66 box27 box35)
   deleted: (clear box35) (on box66 box27)
   added: (on box66 box35) (clear box27)
   goals met: 2 of 9
15. (move box27 box42 box39)
   deleted: (clear box39) (on box27 box42)
   added: (on box27 box39) (clear box42)
   goals met: 2 of 9
16. (move box86 box9 box27)
   deleted: (clear box27) (on box86 box9)
   added: (on box86 box27) (clear box9)
   goals met: 2 of 9
17. (remove-from-base box42 base17)
   deleted: (on-base box42 base17) (clear box42)
   added: (removed box42) (clear-base base17)
   goals met: 3 of 9
18. (remove-from-base box45 base27)
   deleted: (on-base box45 base27) (clear box45)
   added: (removed box45) (clear-base base27)
   goals met: 4 of 9
19. (remove box5 box44)
   deleted: (on box5 box44) (clear box5)
   added: (removed box5) (clear box44)
   goals met: 5 of 9
20. (remove box71 box25)
   deleted: (on box71 box25) (clear box71)
   added: (removed box71) (clear box25)
   goals met: 6 of 9
21. (remove box78 box28)
   deleted: (on box78 box28) (clear box78)
   added: (removed box78) (clear box28)
   goals met: 7 of 9
22. (remove-from-base box88 base4)
   deleted: (on-base box88 base4) (clear box88)
   added: (removed box88) (clear-base base4)
   goals met: 8 of 9
23. (remove box9 box74)
   deleted: (on box9 box74) (clear box9)
   added: (removed box9) (clear box74)
   goals met: 9 of 9
